<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Adobe Reader installer and extracts the embedded package, uploads to JSS.</string>
        <key>Identifier</key>
        <string>com.github.ungerjm.jss.AdobeReader</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AdobeReader</string>
            <key>MAJOR_VERSION</key>
            <string>11</string>
            <key>CATEGORY</key>
            <string>Media Plugins and Viewers</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>Needs Update Adobe Reader</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/AdobeReaderSmartGroupTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/Adobe_Reader.png</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.AdobeReader</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                	<key>version</key>
                    <string>%version%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>extension_attributes</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>AdobeReaderVersion</string>
                            <key>ext_attribute_path</key>
                            <string>%RECIPE_DIR%/AdobeReaderExtensionAttribute.xml</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
