<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jss.WiresharkDev</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>NAME</key>
		<string>Wireshark</string>
		<key>SELFSERVE_POLICY</key>
		<string>Install Latest %NAME%</string>
		<key>SMART_GROUP</key>
		<string>Needs Update %NAME%</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.justinrummel.jss.WiresharkDev</string>
</dict>
</plist>
