<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Adobe Reader updates pkg and repackages, replacing a problematic preinstall script, 
and enabling installation on non-boot volumes. Setting MAJOR_VERSION to "10" will cause a download of the 
latest/last version of Adobe Reader 10, but the repackager is unlikely to operate properly with that version.
</string>
    <key>Identifier</key>
    <string>com.github.quovadimus.pkg.AdobeReaderUpdates</string>
    <key>Input</key>
    <dict>
	</dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.AdobeReaderUpdates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
