<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Shockwave Player installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.quovadimus.jss.AdobeShockwavePlayer</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Media Plugins and Viewers</string>
		<key>DOWNLOAD_URL</key>
		<string>http://fpdownload.macromedia.com/get/shockwave/default/english/macosx/latest/Shockwave_Installer_Full_64bit.dmg</string>
		<key>EXTENSION_PATH</key>
		<string>/Library/Internet\ Plug-Ins/DirectorShockwave.plugin/Contents</string>
		<key>EXTENSION_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates/ExtensionAttributeTemplate.xml</string>
		<key>GROUP_NAME</key>
		<string>Needs Update Shockwave</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates/SmartGroupTemplate-Extension.xml</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/Shockwave.png</string>
		<key>NAME</key>
		<string>Adobe Shockwave Player</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates/PolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string>Install_Shockwave</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>package_info</key>
		<string>Autopkgr Testing</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.pkg.AdobeShockwavePlayer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>policy_trigger</key>
				<string>%POLICY_TRIGGER%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>AdobeShockwavePlayerExtensionAttribute.xml</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
